nitumario/spc20/SPC_20.syscfg
PWM2.$name                              = "PWM_LED_OUTPUT";
PWM2.timerCount                         = 100;
PWM2.ccIndex                            = [0];
PWM2.peripheral.$assign                 = "TIMG7";
PWM2.peripheral.ccp0Pin.$assign         = "PB15";
PWM2.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC5";
PWM2.PWM_CHANNEL_0.ccValue              = 99;
PWM2.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM2.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM2.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM2.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM2.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric20";
PWM2.ccp0PinConfig.enableConfig         = true;
PWM2.ccp0PinConfig.internalResistor     = "PULL_DOWN";

PWM3.$name                              = "PWM_VCHG";
PWM3.ccIndex                            = [1];
PWM3.timerCount                         = 400;
PWM3.peripheral.$assign                 = "TIMG6";
PWM3.peripheral.ccp1Pin.$assign         = "PB3";
PWM3.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC0";
PWM3.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM3.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM3.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM3.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM3.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric12";

PWM4.timerCount                         = 100;
PWM4.ccIndex                            = [1];
PWM4.$name                              = "LEDCTRL_1";
PWM4.peripheral.$assign                 = "TIMA0";
PWM4.peripheral.ccp1Pin.$assign         = "PA9";
PWM4.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM4.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM4.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM4.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM4.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric15";
PWM4.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC1";
PWM4.PWM_CHANNEL_1.ccValue              = 99;

RTC.calYear            = 2025;
RTC.enabledInterrupts  = ["READY"];
RTC.calDOW             = "2";
RTC.calDOM             = 29;
RTC.calMonth           = "7";
RTC.calHour            = 12;
RTC.calMin             = 59;
RTC.peripheral.$assign = "RTC";

SYSCTL.powerPolicy           = "STANDBY0";
SYSCTL.clockTreeEn           = true;
SYSCTL.forceDefaultClkConfig = true;

SYSTICK.periodEnable    = true;
SYSTICK.interruptEnable = true;
SYSTICK.systickEnable   = true;
SYSTICK.period          = 4000;

TIMER1.$name              = "B_INT_TIMER";
TIMER1.interrupts         = ["ZERO"];
TIMER1.timerPeriod        = "150 ms";
TIMER1.timerClkSrc        = "LFCLK";
TIMER1.peripheral.$assign = "TIMG12";

TIMER2.$name              = "ADC_LOW_POWER";
TIMER2.timerClkSrc        = "LFCLK";
TIMER2.timerClkDiv        = 8;
TIMER2.timerClkPrescale   = 256;
TIMER2.timerMode          = "PERIODIC";
TIMER2.timerPeriod        = "1s";
TIMER2.interrupts         = ["ZERO"];
TIMER2.peripheral.$assign = "TIMG8";

UART1.$name                    = "UART_0";
UART1.enabledInterrupts        = ["RX","TX"];
UART1.targetBaudRate           = 115200;
UART1.rxTimeoutValue           = 5;
UART1.peripheral.$assign       = "UART0";
UART1.peripheral.rxPin.$assign = "PA11";
UART1.peripheral.txPin.$assign = "PA10";
UART1.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric0";
UART1.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric1";

VREF.checkVREFReady                = true;
VREF.basicIntVolt                  = "DL_VREF_BUFCONFIG_OUTPUT_2_5V";
VREF.advClkSrc                     = "DL_VREF_CLOCK_BUSCLK";
VREF.advClkDiv                     = "DL_VREF_CLOCK_DIVIDE_8";
VREF.advSHSample                   = 100;
VREF.advSHHold                     = 5000;
VREF.basicVrefPins                 = "VREF+-";
VREF.peripheral.$assign            = "VREF";
VREF.peripheral.vrefPosPin.$assign = "PA23";
VREF.peripheral.vrefNegPin.$assign = "PA21";
VREF.vrefPosPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric22";
VREF.vrefNegPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric25";

ProjectConfig.migrationCondition = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
ADC122.peripheral.$suggestSolution           = "ADC1";
ADC122.peripheral.adcPin4.$suggestSolution   = "PB17";
ADC122.peripheral.adcPin3.$suggestSolution   = "PA18";
GPIO1.associatedPins[0].pin.$suggestSolution = "PB21";
GPIO4.associatedPins[0].pin.$suggestSolution = "PA3";
GPIO4.associatedPins[3].pin.$suggestSolution = "PA29";
